{
  "contact.title": "Contacto",
  "contact.subtitle": "Si quieres comentar un proyecto, compartir una idea o simplemente charlar, puedes escribirme por correo electrónico o a través de LinkedIn.",

  "contact.infoTitle": "Información de contacto",
  "contact.cta": "Escríbeme si te interesa colaborar. Estoy abierto a nuevas oportunidades y retos.",
  "common.email": "Email",
  "common.location": "Ubicación",
  "nav.home": "Inicio",
  "nav.about": "Sobre mí",
  "nav.help": "Cómo puedo ayudar",
  "nav.experience": "Experiencia",
  "nav.certifications": "Certificaciones",
  "nav.faq": "FAQ",
  "nav.contact": "Contacto",
  "footer.rights": "Todos los derechos reservados.",
  "faq.title": "Preguntas frecuentes",
  "faq.subtitle": "Respuestas a preguntas comunes sobre mi perfil, experiencia y disponibilidad.",

  "faq.q1.q": "¿Qué puestos estoy buscando actualmente?",
  "faq.q1.a": "Puestos junior relacionados con Análisis de Datos, Business Intelligence y desarrollo web/orientado a datos, donde los datos apoyen la toma de decisiones y tengan impacto real en producto o negocio.",

  "faq.q2.q": "¿Qué tipo de posición estoy buscando?",
  "faq.q2.a": "Idealmente un puesto junior a tiempo completo con responsabilidad, mentoría y margen de crecimiento. Prefiero enfocarme en trabajo profesional en empresa y no únicamente en programas académicos.",

  "faq.q3.q": "¿Cuál es mi disponibilidad?",
  "faq.q3.a": "Puedo incorporarme pronto. Si necesitas una fecha concreta, escríbeme y lo coordinamos.",

  "faq.q4.q": "¿Qué modalidad de trabajo prefiero?",
  "faq.q4.a": "Preferiblemente remoto, porque ayuda a la concentración y a la gestión del tiempo. También estoy abierto a modalidad híbrida según el equipo y el contexto del proyecto.",

  "faq.q5.q": "¿Con qué tecnologías trabajo?",
  "faq.q5.a": "Mi stack principal incluye Python y SQL, además de desarrollo web con herramientas modernas. También estoy ganando experiencia práctica en cloud (Azure) y herramientas de datos para procesamiento y visualización.",

  "faq.q6.q": "¿Tengo experiencia profesional?",
  "faq.q6.a": "Sí. Durante mis prácticas en DEKRA Digital & Product Solutions trabajé en entorno de producción, aportando funcionalidades full-stack y colaborando en un equipo ágil.",

  "faq.q7.q": "¿Cuál es mi proyecto más relevante?",
  "faq.q7.a": "Mi TFG: una herramienta en el navegador que extrae, procesa y visualiza datos de cursos Moodle, generando dashboards e informes analíticos exportables.",

  "faq.q8.q": "¿Cómo enfoco la comunicación y el trabajo en equipo?",
  "faq.q8.a": "Priorizo una comunicación clara y estructurada y una colaboración proactiva. Me gusta alinear objetivos desde el principio, hacer las preguntas correctas y compartir avances para que el equipo fluya.",

  "faq.q9.q": "¿Qué nivel de inglés tengo?",
  "faq.q9.a": "Tengo un nivel B2 de inglés (Cambridge B2 First). Me siento cómodo leyendo documentación técnica y comunicándome en contextos internacionales.",

  "faq.q10.q": "¿Con qué rapidez suelo responder?",
  "faq.q10.a": "Normalmente respondo en 24–48 horas por email o LinkedIn.",
  "lang.toggle": "Cambiar idioma",
  "lang.en": "Inglés (EN)",
  "lang.es": "Español (ES)",

  "help.title": "¿Qué puedo aportar?",
  "help.subtitle": "Un enfoque práctico y estructurado para analizar datos y crear soluciones útiles en contextos reales.",

  "help.cards.analysis.title": "Análisis de Datos y BI",
  "help.cards.analysis.desc": "Trabajo con datos para explorar patrones, crear visualizaciones y apoyar la toma de decisiones mediante un análisis claro y bien estructurado.",

  "help.cards.web.title": "Desarrollo Web y Orientado a Datos",
  "help.cards.web.desc": "Desarrollo soluciones web donde los datos tienen un papel central, trabajando en backend y frontend para construir funcionalidades útiles y mantenibles.",

  "help.cards.cloud.title": "Fundamentos de infraestructura en la nube",
  "help.cards.cloud.desc": "Trabajo con conceptos básicos de infraestructura en la nube para comprender el despliegue de aplicaciones, la gestión de entornos y la escalabilidad, siempre desde un enfoque práctico aplicado a proyectos reales.",

  "help.cards.comm.title": "Comunicación y Resolución de Problemas",
  "help.cards.comm.desc": "Comunico ideas con claridad, colaboro eficazmente en equipos técnicos y afronto problemas de forma estructurada y orientada a resultados.",
  "approach.title": "Mi enfoque",
  "approach.subtitle": "Un flujo de trabajo sencillo y estructurado que utilizo para aprender, alinear objetivos y aportar valor.",

  "approach.steps.1.title": "Entender",
  "approach.steps.1.desc": "Aclarar objetivos, contexto y requisitos.",

  "approach.steps.2.title": "Planificar",
  "approach.steps.2.desc": "Definir fuentes de datos, alcance y un plan de entrega realista con el equipo.",

  "approach.steps.3.title": "Construir",
  "approach.steps.3.desc": "Desarrollar análisis, flujos de datos, paneles visuales o funcionalidades, siguiendo buenas prácticas de programación.",

  "approach.steps.4.title": "Validar",
  "approach.steps.4.desc": "Comprobar la corrección, los casos límite y el rendimiento, incorporando revisiones y aportaciones del equipo.",

  "approach.steps.5.title": "Entregar",
  "approach.steps.5.desc": "Documentar el trabajo, realizar una entrega clara y mejorar la solución a partir de las revisiones.",

  "certs.title": "Certificaciones",
  "certs.subtitle": "Una selección de certificaciones que reflejan mi aprendizaje práctico en datos, cloud e ingeniería.",
  "certs.badge": "Certificación",
  "certs.view": "Ver certificado",

  "experience.title": "Experiencia",
  "experience.subtitle": "Experiencia profesional, proyectos académicos, formación, certificaciones y actividades de investigación.",
  "experience.timeline.title": "Línea temporal de experiencia",

  "experience.items.paper.title": "Artículo científico (en progreso)",
  "experience.items.paper.subtitle": "Artículo basado en mi Trabajo de Fin de Grado",
  "experience.items.paper.period": "Oct. 2025 – Actualidad",
  "experience.items.paper.grade": "En progreso",
  "experience.items.paper.desc": "Actualmente colaboro en la preparación de un artículo científico basado en mi Trabajo de Fin de Grado, con el objetivo de enviarlo a una revista o conferencia centrada en tecnología educativa y análisis de datos.",

  "experience.items.mda.title": "Moodle Data Analyzer",
  "experience.items.mda.subtitle": "Universidad de Málaga · Trabajo de Fin de Grado",
  "experience.items.mda.period": "Enero 2025 – Sept. 2025",
  "experience.items.mda.desc": "Diseño y desarrollo de una herramienta de análisis de datos basada en navegador para extraer, procesar y visualizar datos académicos de Moodle con el fin de apoyar a los docentes mediante la toma de decisiones basada en datos. Se construyeron paneles interactivos y se generaron informes exportables en diferentes formatos.",

  "experience.items.dekra.title": "DEKRA Digital & Product Solutions",
  "experience.items.dekra.subtitle": "Prácticas",
  "experience.items.dekra.period": "Marzo 2025 – Mayo 2025",
  "experience.items.dekra.desc": "Desarrollé y mantuve funcionalidades web full-stack para una plataforma de ciberseguridad, trabajando con Django, Angular y PostgreSQL en un entorno de producción. Implementé lógica de backend e integré componentes de frontend, mejorando la consistencia y funcionalidad de varios módulos. Participé en despliegue y gestión de entornos con Docker, permitiendo un desarrollo más estable y reproducible. Colaboré en un entorno ágil usando Jira para la planificación y GitLab para control de versiones e integración. Contribuí a código en producción, ganando experiencia profesional práctica y reforzando habilidades de trabajo en equipo.",

  "experience.items.degree.title": "Grado en Ingeniería Informática",
  "experience.items.degree.subtitle": "Universidad de Málaga · Especialidad en Sistemas de Información",
  "experience.items.degree.period": "2020 – 2025",
  "experience.items.degree.desc": "Grado en Ingeniería Informática en la Universidad de Málaga, con especialidad en Sistemas de Información y una formación orientada al análisis y gestión de datos para apoyar la toma de decisiones. Adquirí una base sólida en programación, bases de datos, matemáticas y estadística, así como en el diseño y análisis de sistemas de información, desarrollando una visión estructurada del ciclo de vida de los datos. Especialización progresiva en análisis de datos y Business Intelligence, trabajando con Python, SQL, Power BI y entornos cloud. Apliqué estas habilidades en proyectos académicos y prácticas en empresa, reforzando el trabajo en equipo y la comunicación técnica.",

  "experience.items.bach.title": "Bachillerato Tecnológico",
  "experience.items.bach.subtitle": "IES Torre Almirante",
  "experience.items.bach.period": "2018 – 2020",
  "experience.items.bach.desc": "Bachillerato Tecnológico centrado en pensamiento lógico, matemáticas académicas y resolución estructurada de problemas, sirviendo como base de mi formación técnica posterior. Esta etapa reforzó el razonamiento analítico y proporcionó una base sólida para estudios posteriores en ingeniería informática.",
  "experience.gradeLabel": "Nota:",
  "common.logo": "logo",
  "experience.research.title": "Artículo científico",
  "experience.research.desc": "Actualmente colaboro en la preparación de un artículo científico basado en mi Trabajo de Fin de Grado, con el objetivo de enviarlo a una revista o conferencia centrada en tecnología educativa y análisis de datos.",
  "projects.badge.public": "Público",

  "projects.moodle.title": "Moodle Data Analyzer",
  "projects.moodle.institution": "Universidad de Málaga",
  "projects.moodle.type": "Trabajo de Fin de Grado",

  "projects.moodle.desc.short": "Herramienta de análisis de datos basada en navegador que extrae, procesa y visualiza datos académicos de Moodle, transformando datos en bruto en gráficas atractivas.",

  "projects.moodle.desc.long": "Diseño y desarrollo de una herramienta de análisis de datos basada en navegador para la extracción, procesamiento y visualización de datos académicos de Moodle, orientada a apoyar la toma de decisiones basada en datos en contextos educativos. Aplicación de técnicas de extracción de datos, procesamiento analítico y flujos de análisis para transformar datos en bruto en información estructurada y paneles interactivos. Generación de informes analíticos exportables en formatos PDF, CSV y DOCX, facilitando una interpretación clara y un uso práctico de los resultados. Fuerte enfoque en visualización de datos y data storytelling para comunicar claramente patrones de uso, participación y rendimiento académico. Uso de React, Webpack, Chart.js, TailwindCSS, Docker y metodologías ágiles en el desarrollo de la solución. Preparación de un artículo científico actualmente en curso, reforzando la relevancia analítica y el impacto práctico del proyecto en el ámbito de la analítica educativa.",

  "projects.tech.agile": "Metodologías ágiles",

  "projects.portfolio.title": "Sitio web de portafolio personal",
  "projects.portfolio.desc": "Sitio web de portafolio personal diseñado para presentar mi perfil profesional, experiencia y proyectos con una interfaz limpia y moderna, con un fuerte enfoque en claridad, estructura y usabilidad.",
  "projects.screenshot": "captura",
  "projects.prevImage": "Imagen anterior",
  "projects.nextImage": "Imagen siguiente",
  "projects.carouselPagination": "Paginación del carrusel",
  "projects.gradeLabel": "Nota:",
  "projects.repository": "Repositorio",
  "projects.featured.title": "Proyectos destacados",
  "projects.featured.subtitle": "Una selección de proyectos donde apliqué datos, ingeniería y visualización para resolver problemas reales.",
  "projects.linkedin.title": "Análisis del mercado laboral en LinkedIn",
  "projects.linkedin.desc": "Análisis de un conjunto de datos a gran escala de ofertas de empleo publicadas en LinkedIn (2023–2024), orientado a extraer insights sobre demanda laboral, habilidades, ubicaciones, modalidades de trabajo y patrones salariales mediante flujos de análisis propios de entornos de business analytics.",

  "hero.subtitle": "Ingeniero Informático · Análisis de datos",
  "hero.description": "Diseño y desarrollo soluciones de software prácticas, convirtiendo ideas y requisitos en herramientas fiables que aportan valor real.",
  "highlights.growth.title": "En continuo crecimiento",
  "highlights.growth.desc": "Sólida base técnica, junto con una motivación constante por aprender, mejorar y adaptarme a nuevas tecnologías en proyectos reales.",

  "highlights.enjoy.title": "Qué disfruto construir",
  "highlights.enjoy.desc": "Soluciones software que combinan desarrollo, datos y comunicación para apoyar la toma de decisiones y mejorar productos reales.",

  "highlights.stack.title": "Stack tecnológico",
  "metrics.title": "Aspectos destacados",
  "metrics.subtitle": "Aspectos clave de mi perfil, base técnica y experiencia práctica en proyectos.",

  "metrics.junior.value": "Junior",
  "metrics.junior.label": "Listo para contribuir y seguir creciendo",

  "metrics.certs": "Certificaciones",
  "metrics.tech": "Tecnologías utilizadas en proyectos",
  "metrics.projects": "Proyectos desarrollados",

  "interests.title": "Intereses",
  "interests.subtitle": "Áreas en las que quiero crecer y generar impacto real.",

  "interests.cards.data.title": "Análisis de datos y visualización",
  "interests.cards.data.text": "Análisis de datos y creación de visualizaciones claras y herramientas visuales que facilitan la comprensión y la toma de decisiones.",

  "interests.cards.web.title": "Desarrollo web",
  "interests.cards.web.text": "Desarrollo de interfaces y funcionalidades interactivas, con especial atención a la claridad y la usabilidad.",

  "interests.cards.cloud.title": "Entornos en la nube y automatización",
  "interests.cards.cloud.text": "Trabajo con entornos en la nube y automatización básica para el despliegue y mantenimiento de aplicaciones modernas.",

  "keyTech.title": "Tecnologías clave",
  "keyTech.subtitle": "Herramientas y tecnologías que utilizo para desarrollar soluciones basadas en datos de principio a fin.",

  "keyTech.data.title": "Datos y analítica",
  "keyTech.data.description": "Exploración de datos, creación de paneles visuales y transformación de la información en conclusiones claras y prácticas.",

  "keyTech.additional": "Herramientas adicionales",

  "keyTech.dev.title": "Desarrollo y herramientas",
  "keyTech.dev.description": "Desarrollo de interfaces web y aplicaciones mediante herramientas modernas, control de versiones y flujos de trabajo ágiles.",

  "reviews.title": "Valoraciones profesionales",
  "reviews.subtitle": "Algunas palabras de supervisores y mentores que han seguido mi trabajo en proyectos reales.",
  "reviews.viewLinkedIn": "Ver en LinkedIn",

  "reviews.uma.quote": "Mi más sincera enhorabuena por el proyecto tan cuidado que has desarrollado y por la excelente calificación obtenida, que sin duda mereces. Te deseo lo mejor en esta nueva etapa y qué mejor forma de iniciarla que dando el salto hacia un buen artículo científico a partir del gran trabajo realizado.",
  "reviews.uma.role": "Profesor e investigador en IA · Universidad de Málaga",

  "reviews.dekra.quote": "Gracias, Raúl. Nos sorprendió la rapidez con la que te adaptaste al proyecto, aportando desde el primer día y entregando funcionalidades de primer nivel. Ha sido un placer contar contigo en el equipo. Te espera una carrera profesional llena de éxitos.",
  "reviews.dekra.role": "Desarrollo Full Stack · DEKRA Digital Solutions",
  "cv.title": "Currículum Vitae",
  "cv.subtitle": "Descarga mi CV para una visión detallada de mi formación y experiencia.",
  "cv.cardTitle": "CV · Raúl García Balongo",
  "cv.cardText": "Incluye formación académica, proyectos, habilidades técnicas y experiencia.",
  "cv.download": "Descargar CV",
  "about.hero.intro": "Soy ",
  "about.hero.role": "Ingeniero Informático",
  "home.hero.title.beforeDecisions": "Transformando datos en",
  "home.hero.title.decisions": "decisiones",
  "home.hero.title.middle": " y convirtiendo ideas en",
  "home.hero.title.products": "productos",
  "home.hero.title.afterProducts": " fiables.",

  "home.hero.subtitle": "Ingeniero Informático (Sistemas de Información) por la Universidad de Málaga, centrado en el análisis de datos y en crear soluciones prácticas que apoyen la toma de decisiones.",

  "home.hero.bullets.1.before": "Base sólida en",
  "home.hero.bullets.1.highlight": "matemáticas, estadística y razonamiento lógico",

  "home.hero.bullets.2.before": "Experiencia trabajando con",
  "home.hero.bullets.2.tech": "Python, SQL, Spark, Power BI, Tableau",
  "home.hero.bullets.2.middle": "y entornos cloud como",
  "home.hero.bullets.2.cloud": "Azure",

  "home.hero.bullets.3.before": "Experiencia trabajando en equipo con",
  "home.hero.bullets.3.highlight": "metodologías ágiles",
  "home.hero.bullets.3.after": "y código limpio y mantenible.",

  "home.traits.curiosity.title": "Curiosidad",
  "home.traits.curiosity.beforeWhy": "Me gusta entender el ",
  "home.traits.curiosity.why": "“por qué” detrás de los datos",
  "home.traits.curiosity.afterWhy": " y explorar patrones.",

  "home.traits.criticalThinking.title": "Pensamiento crítico",
  "home.traits.criticalThinking.before": "Cuestiono conclusiones, valido supuestos y busco ",
  "home.traits.criticalThinking.highlight": "conclusiones sólidas",

  "home.traits.communication.title": "Comunicación",
  "home.traits.communication.before": "Transformo el análisis técnico en ",
  "home.traits.communication.highlight": "mensajes claros",
  "home.traits.communication.after": ", orientados a la toma de decisiones y a los siguientes pasos.",

  "home.next.title": "Hacia dónde quiero avanzar",

  "home.next.beforeJunior": "Mi objetivo es incorporarme a un equipo como ",
  "home.next.junior": "perfil junior",
  "home.next.middle": ", aportando desde el primer día en proyectos reales mientras construyo una carrera sólida en ",
  "home.next.dataAnalysis": "Análisis de Datos",
  "home.next.businessIntelligence": "Business Intelligence",
  "home.next.dataOrientedDev": "desarrollo orientado a datos",
  "home.next.and": " y ",
  "home.next.webDev": "desarrollo web",

  "home.cards.lookingFor.title": "Lo que estoy buscando",
  "home.cards.lookingFor.before": "Un puesto ",
  "home.cards.lookingFor.highlight": "estable a jornada completa",
  "home.cards.lookingFor.after": ", con responsabilidad, aprendizaje continuo y un impacto real en producción.",

  "home.cards.notFocus.title": "No es mi prioridad",
  "home.cards.notFocus.item1": "Programas de formación independientes",
  "home.cards.notFocus.item2": "Másteres o doctorados",
  "home.cards.notFocus.item3": "Trayectorias puramente académicas",

  "home.cards.motivation.title": "Motivación",
  "home.cards.motivation.before": "Roles que combinan ",
  "home.cards.motivation.analysis": "análisis",
  "home.cards.motivation.middle": " y ",
  "home.cards.motivation.visualization": "visualización",
  "home.cards.motivation.after": " donde los datos apoyan decisiones y mejoran productos, procesos o servicios.",
  "home.work.title": "Cómo trabajo con equipos y retos",

  "home.work.cards.analytical.title": "Pensamiento analítico y estructurado",
  "home.work.cards.analytical.text": "Descompongo problemas complejos en pasos claros y aporto soluciones con un enfoque orientado a resultados.",

  "home.work.cards.consistency.title": "Constancia y perseverancia",
  "home.work.cards.consistency.text": "Trabajo con constancia incluso en situaciones exigentes, avanzando hasta lograr una solución sólida y lista para producción.",

  "home.work.cards.communication.title": "Comunicación y colaboración",
  "home.work.cards.communication.text": "Me comunico con claridad para asegurar que las soluciones respondan tanto a las necesidades técnicas como a las del negocio.",

  "home.work.cards.planning.title": "Planificación y gestión del tiempo",
  "home.work.cards.planning.text": "Priorizo correctamente, gestiono plazos y mantengo los proyectos avanzando de forma constante.",

  "home.work.cards.adaptability.title": "Adaptabilidad y aprendizaje",
  "home.work.cards.adaptability.text": "Me adapto con rapidez a nuevas herramientas y entornos, y mantengo una actitud de aprendizaje continuo en proyectos reales.",

  "home.work.cards.ownership.title": "Responsabilidad y compromiso",
  "home.work.cards.ownership.text": "Asumo la responsabilidad de mi trabajo, llevo las tareas hasta el final y cuido la calidad y el impacto del resultado final.",
  "home.workArrangement.title": "Modalidad de trabajo",

  "home.workArrangement.remote.title": "Trabajo remoto",
  "home.workArrangement.remote.badge": "Preferente",
  "home.workArrangement.remote.text": "Es la modalidad en la que mejor rindo. El trabajo remoto facilita la concentración, una gestión más eficiente del tiempo y reduce los costes asociados a vivienda y desplazamientos.",

  "home.workArrangement.hybrid.title": "Trabajo híbrido",
  "home.workArrangement.hybrid.text": "También estoy abierto a modelos híbridos, en función del equipo, el contexto del proyecto y la etapa profesional.",

  "home.languages.title": "Idiomas",

  "home.languages.english.title": "Inglés",
  "home.languages.english.level": "B2 · Intermedio alto",
  "home.languages.english.certificate": "Cambridge English Level 1 (B2)",
  "home.languages.english.aria": "Nivel de inglés: B2",

  "home.languages.spanish.title": "Español",
  "home.languages.spanish.level": "Nativo",
  "home.languages.spanish.aria": "Nivel de español: Nativo"
}
